const BLOG_PATH = 'blog-posts/'; // Путь к изображениям или файлам блогов

const blogPosts = [
    {
        id: 'post-1',
        title: 'Как я создавал дракона в Blender',
        date: '2023-10-15',
        content: 'В этой статье я расскажу, как я моделировал и рендерил дракона для моего последнего проекта, используя Blender и ZBrush. Это был сложный, но увлекательный процесс, включающий скульптинг, текстурирование и анимацию.',
        category: 'Art',
        image: `images/art/daylight.webp`, // Изображение поста
        author: 'IIL Workshop'
    },
    {
        id: 'post-2',
        title: 'Секреты создания реалистичных интерьеров',
        date: '2023-11-01',
        content: 'Здесь я делюсь советами по созданию реалистичных 3D-интерьеров с помощью 3ds Max и V-Ray. От освещения до текстур — всё, что нужно знать для профессионального результата.',
        category: 'Interiors',
        image: `images/art/daylight.webp`,
        author: 'IIL Workshop'
    }
    // Добавь больше постов по необходимости
];